VatEngine/target/test-classes/GCC_test11_LocalSaleGoods_UAE_UAE_toRegistered_UAECompany.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <AnalyseDocument xmlns="http://tempuri.org/">
      <document><![CDATA[<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/xsl" href="http://www.vatat.com/xml/vatat_invoice_view_jscript.xsl"?>
<iVATEngineInput>
<IncludeReportingIndicationInResponse>1</IncludeReportingIndicationInResponse>
	<Supplier>
		<ID>112213</ID>
		<Name>AEDHLclienttest</Name>
		<Address/>
		<ZIP/>
		<City/>
		<Country>AE</Country>
		<RegOfCommerce/>
		<BancAccountNumber/>
		<IBAN/>
		<BIC/>
		<TelephoneNumber/>
		<FaxNumber/>
		<EmailAddress/>
		<SpecialType>0</SpecialType>
		<DeductionType>0</DeductionType>
		<VATNumberSupplier Country="AE">
			<VATNumber>AE123456788</VATNumber>
			<VATNumberType>1</VATNumberType>
			<Name/>
			<Address1/>
			<Address2/>
			<Address3/>
			<TaxNumber/>
			<BelongsToFiscalUnit>0</BelongsToFiscalUnit>
		</VATNumberSupplier>
		<CountryChosenVATNumber>AE</CountryChosenVATNumber>
	</Supplier>
	<Customer>
		<ID>112211</ID>
		<Name>AECOMPANY B</Name>
		<Address>2</Address>
		<ZIP/>
		<City/>
		<EmailAddress/>
		<Country>AE</Country>
		<SpecialType>0</SpecialType>
		<VATNumberCustomer Country="AE">
			<VATNumber>AE123456780</VATNumber>
			<VATNumberType>1</VATNumberType>
			<Name/>
			<Address1/>
			<Address2/>
			<Address3/>
			<RequiredOnInvoicePicture>false</RequiredOnInvoicePicture>
			<BelongsToFiscalUnit>1</BelongsToFiscalUnit>
		</VATNumberCustomer>
		<CountryChosenVATNumber>AE</CountryChosenVATNumber>
	</Customer>
	<InvoiceProperties>
		<DocumentType>0</DocumentType>
		<Disconto>0</Disconto>
		<Currency1>EUR</Currency1>
		<InvoiceNumber/>
		<ReferenceInvoiceNumber/>
		<InvoiceDate>2018-09-27</InvoiceDate>
		<OfficialLanguage>3</OfficialLanguage>
	</InvoiceProperties>
	<Item ID="1">
		<Properties>
			<Description/>
			<InternationalDescription LanguageID="1">roerende goederen / geen installatie (-100-)</InternationalDescription>
			<InternationalDescription LanguageID="2">biens mobiliers / pas d&#180;installation (-100-)</InternationalDescription>
			<InternationalDescription LanguageID="3">Movable tangible property / No installation (-100-)</InternationalDescription>
			<InternationalDescription LanguageID="5">Mobilien / Keine Installation (-100 -) </InternationalDescription>
			<TaricCode/>
			<Amounts CurrencyNumber="1">
				<UnitPriceExclVAT>100</UnitPriceExclVAT>
				<TotalAmountExclVAT>100</TotalAmountExclVAT>
				<PackagingCosts>0</PackagingCosts>
			</Amounts>
			<Number>1</Number>
			<Unit/>
			<VATRate>5</VATRate>
			<Reduction>0</Reduction>
			<AdditionalProperties>
				<PropertiesPerCountry Country="AE">
					<VATRateCode>S</VATRateCode>
				</PropertiesPerCountry>
				<EngineParameter1>AAAA</EngineParameter1>
				<EngineParameter2/>
				<EngineParameter3/>
			</AdditionalProperties>
			<ItemClassificationCode>100</ItemClassificationCode>
			<OutOfVAT>0</OutOfVAT>
			<ReportingProperties>
				<CommodityCode/>
			</ReportingProperties>
			<ItemClassificationCode>100</ItemClassificationCode>	
		</Properties>
		<Conditions>
			<ShipFrom>
				<CountryDeparture>AE</CountryDeparture>
			</ShipFrom>
			<ShipTo>
				<CountryArrival>AE</CountryArrival>
			</ShipTo>
			<Installation>0</Installation>
			<Transporter>1</Transporter>
			<DateTransaction>2018-09-27</DateTransaction>
		</Conditions>
		<AdditionalMentioning>
			<Text>The goods are not installed.</Text>
		</AdditionalMentioning>
		<AdditionalMentioning>
			<Text>The goods are located in United Arab Emirates.</Text>
		</AdditionalMentioning>
	</Item>
</iVATEngineInput>]]></document>
    </AnalyseDocument>
  </soap:Body>
</soap:Envelope>